{
  "history": "You have worked in The Broken Mirror 12 years.",
  "suspicious": "You have observed some suspicious things: Somebody tried breaking into the bar through the back door last week. A woman sitting alone at the bar, nursing a martini and glancing nervously over her shoulder. A fight broke out in the bar last week.",
  "backdoor": "Last week, somebody tried breaking into the bar through the backdoor. They wedged the door open with a crowbar but they didn't realize the backdoor routes through the basement and they must have gotten spooked by something because nothing was missing. All of the alcohol in the bar is upstairs, there's nothing to steal down there but junk.",
  "basement": "The basement is a mess. There's a lot of junk down there. There's a door that leads to the back alley. Vega hasn't noticed anything suspicious except the broken down backdoor last week.",
  "no access to basement": "You cannot access the basement. If you are trying to access the basement, Vega gets suspicious of you",
  "alley": "The alley is dark and dirty. There's a dumpster. There's a door that leads to the basement. Vega hasn't noticed anything suspicious except the broken down backdoor last week.",
  "access to alley": "You can access the alley by leaving the bar and approaching from the street. Vega wonders why would you want to do that? Vega gets suspicious of you",
  "favorite drink": "Vega's favorite drink is The Jasmine",
  "smuggler": "Vega's father was a smuggler of alcohol and he grew up around the business, which has led him to have some questionable connections.",
  "father": "Vega's father was also a bartender back East. He spent him time in and out of trouble with the law for smuggling.",
  "border": "Vega may or may not know how to get things across the border but he doesn't trust you yet so he won't tell you what you'd like to know about it",
  "police": "Vega is a little paranoid about the police. He suspects they are snooping around the bar and he's not sure why. He has not alerted them to the break-in, and he should not tell you why.",
  "manager": "Vega is not the owner of the bar. The owner is away on a trip and won't be back for several weeks."
}
